{
    "books": [
        {
            "id": 1,
            "title": "To Kill a Mockingbird",
            "author": "Harper Lee",
            "genre": "Fiction",
            "genre_thumbnail": "https://i.ibb.co/hX8X6yM/fiction.jpg",
            "price": 12.99,
            "cover_image": "https://i.ibb.co/Mh0hh8s/image1.png",
            "description": "A classic novel by Harper Lee, 'To Kill a Mockingbird' explores themes of racism and injustice in the American South. Set in the 1930s, it tells the story of young Scout Finch and her father, Atticus Finch, a lawyer defending a black man accused of rape. This timeless tale is a must-read for all ages.",
            "short_description": "A classic novel that explores themes of racism and injustice in the American South.",
            "rating": 4.5
        },
        {
            "id": 2,
            "title": "1984",
            "author": "George Orwell",
            "genre": "Dystopian",
            "genre_thumbnail": "https://i.ibb.co/c60xm2r/dystopian.jpg",
            "price": 14.99,
            "cover_image": "https://i.ibb.co/QcJ5zhR/image2.jpg",
            "description": "In George Orwell's '1984,' the world is under the oppressive rule of the Party, led by Big Brother. Winston Smith, a low-ranking member, rebels against the surveillance state. This dystopian classic serves as a warning about totalitarianism and the loss of individual freedom.",
            "short_description": "A dystopian novel depicting a totalitarian regime and its impact on society.",
            "rating": 4.7
        },
        {
            "id": 3,
            "title": "The Great Gatsby",
            "author": "F. Scott Fitzgerald",
            "genre": "Classic",
            "genre_thumbnail": "https://i.ibb.co/S5tx7xm/classic.jpg",
            "price": 11.99,
            "cover_image": "https://i.ibb.co/SJGCgCc/image3.jpg",
            "description": "F. Scott Fitzgerald's 'The Great Gatsby' is a tale of decadence, wealth, and the American Dream in the Roaring Twenties. It follows the enigmatic Jay Gatsby and his love for Daisy Buchanan. The novel explores themes of love, illusion, and the pursuit of happiness.",
            "short_description": "A tale of decadence, wealth, and the American Dream in the Roaring Twenties.",
            "rating": 4.3
        },
        {
            "id": 4,
            "title": "The Hobbit",
            "author": "J.R.R. Tolkien",
            "genre": "Fantasy",
            "genre_thumbnail": "https://i.ibb.co/zJGm9xL/fantasy.jpg",
            "price": 15.99,
            "cover_image": "https://i.ibb.co/9Yqw9TH/image4.jpg",
            "description": "Join Bilbo Baggins, a hobbit, on an epic adventure in J.R.R. Tolkien's 'The Hobbit.' Accompanied by Gandalf the wizard and a group of dwarves, Bilbo sets out to reclaim treasure guarded by the fearsome dragon Smaug. This classic fantasy novel is filled with magic, courage, and heroism.",
            "short_description": "An adventure of a hobbit, a wizard, and a group of dwarves on a quest.",
            "rating": 4.6
        },
        {
            "id": 5,
            "title": "The Catcher in the Rye",
            "author": "J.D. Salinger",
            "genre": "Coming of Age",
            "genre_thumbnail": "https://i.ibb.co/MRxt6YD/coming-of-age.png",
            "price": 10.99,
            "cover_image": "https://i.ibb.co/Cv3kqGg/image5.jpg",
            "description": "J.D. Salinger's 'The Catcher in the Rye' is a novel about teenage alienation and the search for authenticity. Follow the journey of Holden Caulfield, a disenchanted teenager, as he navigates the complexities of growing up in a world he finds phony and hypocritical.",
            "short_description": "A novel about teenage alienation and the search for authenticity.",
            "rating": 4.2
        },
        {
            "id": 6,
            "title": "Pride and Prejudice",
            "author": "Jane Austen",
            "genre": "Romance",
            "genre_thumbnail": "https://i.ibb.co/k8jft1q/romance.jpg",
            "price": 9.99,
            "cover_image": "https://i.ibb.co/Z15KnRK/image6.jpg",
            "description": "Jane Austen's 'Pride and Prejudice' is a classic love story featuring Elizabeth Bennet and Mr. Darcy. Set in the early 19th century, it explores themes of class, reputation, and the complexities of romantic relationships in a society obsessed with marriage.",
            "short_description": "A classic love story featuring Elizabeth Bennet and Mr. Darcy.",
            "rating": 4.4
        },
        {
            "id": 7,
            "title": "Moby-Dick",
            "author": "Herman Melville",
            "genre": "Adventure",
            "genre_thumbnail": "https://i.ibb.co/SwKZmYV/adventure.jpg",
            "price": 13.99,
            "cover_image": "https://i.ibb.co/Hz48sfv/image7.jpg",
            "description": "Herman Melville's 'Moby-Dick' is the epic tale of Captain Ahab's obsession with a white whale. Join the crew of the Pequod on a dangerous and symbolic journey in pursuit of the elusive Moby Dick. This novel explores themes of vengeance, fate, and the power of nature.",
            "short_description": "The epic tale of Captain Ahab's obsession with a white whale.",
            "rating": 4.1
        },
        {
            "id": 8,
            "title": "The Lord of the Rings",
            "author": "J.R.R. Tolkien",
            "genre": "Fantasy",
            "genre_thumbnail": "https://i.ibb.co/zJGm9xL/fantasy.jpg",
            "price": 19.99,
            "cover_image": "https://i.ibb.co/JBLg2KD/image8.jpg",
            "description": "J.R.R. Tolkien's 'The Lord of the Rings' is the epic fantasy trilogy that follows the quest to destroy a powerful ring and save Middle-earth from the dark lord Sauron. This masterpiece is filled with rich world-building, memorable characters, and themes of friendship and heroism.",
            "short_description": "The epic fantasy trilogy featuring a quest to destroy a powerful ring.",
            "rating": 4.8
        },
        {
            "id": 9,
            "title": "Brave New World",
            "author": "Aldous Huxley",
            "genre": "Dystopian",
            "genre_thumbnail": "https://i.ibb.co/c60xm2r/dystopian.jpg",
            "price": 14.99,
            "cover_image": "https://i.ibb.co/9ZBrKNr/image9.jpg",
            "description": "Aldous Huxley's 'Brave New World' envisions a future society driven by technology and social control. In this dystopian world, individuality is suppressed, and citizens are kept content with pleasure and conformity. This thought-provoking novel explores the consequences of a dehumanized society.",
            "short_description": "A vision of a future society driven by technology and social control.",
            "rating": 4.6
        },
        {
            "id": 10,
            "title": "The Hunger Games",
            "author": "Suzanne Collins",
            "genre": "Science Fiction",
            "genre_thumbnail": "https://i.ibb.co/MPjLZfC/science-fiction.jpg",
            "price": 12.99,
            "cover_image": "https://i.ibb.co/HpQLp6v/image10.jpg",
            "description": "In Suzanne Collins' 'The Hunger Games,' teenagers are forced to compete in deadly games in a dystopian society. Follow Katniss Everdeen as she becomes a symbol of rebellion against the oppressive Capitol. This thrilling series explores themes of survival, sacrifice, and resistance.",
            "short_description": "A dystopian series where teenagers are forced to compete in deadly games.",
            "rating": 4.3
        },
        {
            "id": 11,
            "title": "Harry Potter and the Chamber of Secrets",
            "author": "J.K. Rowling",
            "genre": "Fantasy",
            "genre_thumbnail": "https://i.ibb.co/zJGm9xL/fantasy.jpg",
            "price": 11.99,
            "cover_image": "https://i.ibb.co/PcBLjTP/image11.jpg",
            "description": "In the second book of the Harry Potter series, Harry returns to Hogwarts School of Witchcraft and Wizardry, but a dark force threatens the students. Follow Harry, Ron, and Hermione as they uncover the mystery of the Chamber of Secrets and the monster within.",
            "short_description": "The second book in the beloved Harry Potter series.",
            "rating": 4.8
        },
        {
            "id": 12,
            "title": "The Alchemist",
            "author": "Paulo Coelho",
            "genre": "Philosophical",
            "genre_thumbnail": "https://i.ibb.co/JKTzXm6/philosophical.jpg",
            "price": 10.99,
            "cover_image": "https://i.ibb.co/KKLp2Lw/image12.jpg",
            "description": "Paulo Coelho's 'The Alchemist' is a philosophical novel that follows Santiago, a shepherd boy, on his journey to discover his personal legend and fulfill his dreams. This timeless tale of self-discovery and destiny has inspired readers around the world.",
            "short_description": "A journey of self-discovery and personal legend.",
            "rating": 4.7
        },
        {
            "id": 13,
            "title": "The Shining",
            "author": "Stephen King",
            "genre": "Horror",
            "genre_thumbnail": "https://i.ibb.co/NnyRv0m/horror.jpg",
            "price": 13.99,
            "cover_image": "https://i.ibb.co/RNVMZtw/image13.jpg",
            "description": "Stephen King's 'The Shining' tells the terrifying story of the Torrance family's winter caretaking job at the haunted Overlook Hotel. As the hotel's supernatural horrors manifest, the family's sanity is tested. This classic horror novel is a spine-chilling experience.",
            "short_description": "A family's terrifying experience in an isolated hotel.",
            "rating": 4.2
        },
        {
            "id": 14,
            "title": "The Road",
            "author": "Cormac McCarthy",
            "genre": "Post-Apocalyptic",
            "genre_thumbnail": "https://i.ibb.co/rcQpGm2/post-apocalyptic.jpg",
            "price": 12.99,
            "cover_image": "https://i.ibb.co/XyjL1pz/image14.jpg",
            "description": "Cormac McCarthy's 'The Road' follows a father and son's harrowing journey through a desolate, post-apocalyptic world. They face danger, scarcity, and moral dilemmas as they search for safety and hope in a bleak landscape.",
            "short_description": "A gripping story of survival in a post-apocalyptic world.",
            "rating": 4.5
        },
        {
            "id": 15,
            "title": "The Da Vinci Code",
            "author": "Dan Brown",
            "genre": "Mystery",
            "genre_thumbnail": "https://i.ibb.co/C5pMx0f/mystery.jpg",
            "price": 11.99,
            "cover_image": "https://i.ibb.co/fGbF2pn/image15.jpg",
            "description": "Dan Brown's 'The Da Vinci Code' is a thrilling mystery that revolves around religious symbolism and secret societies. Follow Robert Langdon as he deciphers cryptic codes and unravels the secrets of the Holy Grail, all while evading danger at every turn.",
            "short_description": "A fast-paced mystery involving religious symbolism and secret societies.",
            "rating": 4.4
        },
        {
            "id": 16,
            "title": "A Song of Ice and Fire",
            "author": "George R.R. Martin",
            "genre": "Fantasy",
            "genre_thumbnail": "https://i.ibb.co/zJGm9xL/fantasy.jpg",
            "price": 19.99,
            "cover_image": "https://i.ibb.co/cDT4VKV/image16.jpg",
            "description": "George R.R. Martin's 'A Song of Ice and Fire' is an epic fantasy series that inspired the TV show Game of Thrones. It features complex characters, political intrigue, and battles for power in the fictional continents of Westeros and Essos.",
            "short_description": "The epic fantasy series that inspired Game of Thrones.",
            "rating": 4.8
        },
        {
            "id": 17,
            "title": "The Road Less Traveled",
            "author": "M. Scott Peck",
            "genre": "Self-Help",
            "genre_thumbnail": "https://i.ibb.co/Wzwks7P/self-help.jpg",
            "price": 9.99,
            "cover_image": "https://i.ibb.co/5vpHYHs/image17.jpg",
            "description": "M. Scott Peck's 'The Road Less Traveled' is a self-help guide that explores the journey of personal growth and spiritual development. It offers valuable insights into the path to a more fulfilling and meaningful life.",
            "short_description": "A guide to personal growth and spiritual development.",
            "rating": 4.6
        },
        {
            "id": 18,
            "title": "The Girl on the Train",
            "author": "Paula Hawkins",
            "genre": "Thriller",
            "genre_thumbnail": "https://i.ibb.co/dBwsWFx/thriller.jpg",
            "price": 12.99,
            "cover_image": "https://i.ibb.co/Lzx2dC0/image18.jpg",
            "description": "Paula Hawkins' 'The Girl on the Train' is a psychological thriller that delves into the lives of three women connected by a mysterious disappearance. With shifting perspectives and unexpected twists, this novel keeps readers on the edge of their seats.",
            "short_description": "A gripping psychological thriller involving three women.",
            "rating": 4.3
        },
        {
            "id": 19,
            "title": "The Art of War",
            "author": "Sun Tzu",
            "genre": "Military",
            "genre_thumbnail": "https://i.ibb.co/TcnBtB2/military.jpg",
            "price": 8.99,
            "cover_image": "https://i.ibb.co/CVtSgwP/image19.jpg",
            "description": "Sun Tzu's 'The Art of War' is an ancient treatise on strategy and warfare. It offers timeless wisdom on tactics, leadership, and the art of winning battles, making it a valuable resource for both military leaders and business strategists.",
            "short_description": "An ancient treatise on strategy and warfare.",
            "rating": 4.7
        },
        {
            "id": 20,
            "title": "Gone with the Wind",
            "author": "Margaret Mitchell",
            "genre": "Historical Fiction",
            "genre_thumbnail": "https://i.ibb.co/jH95LCm/historical-fiction.jpg",
            "price": 15.99,
            "cover_image": "https://i.ibb.co/J54jhrs/image20.jpg",
            "description": "Margaret Mitchell's 'Gone with the Wind' is a sweeping epic set against the backdrop of the American Civil War. It follows the life of Scarlett O'Hara and her tumultuous romance with Rhett Butler. This classic novel explores love, resilience, and the transformation of a nation.",
            "short_description": "A sweeping epic set against the backdrop of the American Civil War.",
            "rating": 4.4
        }
    ]
}